# BentFabricLongitudinalCutLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..BentFabricLongitudinalCutLength Property
FabricSheet Class See Also
---
Specifies the cut length of the fabric sheet perpendicular to the bend edge.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double BentFabricLongitudinalCutLength { get; set; }
```

Visual Basic
---
```text
Public Property BentFabricLongitudinalCutLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BentFabricLongitudinalCutLength {
	double get ();
	void set (double value);
}
```

# Remarks
Zero indicates that the fabric sheet is not shortened. This parameter applies only to bent fabric sheets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for bentFabricLongitudinalCutLength must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidObjectException | When setting this property: The data-setting method is not applicable to fabric sheets that are flat. |

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace